0.1.0/tutorials/incompressible/dym-pimple/propeller/0.org/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            fixedValue;
    value           uniform (0 -5 0);
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform (0 0 0);
    value           uniform (0 0 0);
  }
  outerCylinder
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  "propeller.*"
  {
    type            movingWallVelocity;
    value           uniform (0 0 0);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
