0.1.0/tutorials/incompressible/dym-pimple/propeller/0.org/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet
  {
    type            calculated;
    value           uniform 0;
  }
  wall
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
