0.1.0/tutorials/incompressible/dym-pimple/propeller/system/createPatchDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      createPatchDict;
}

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;
// Patches to create.
patches
(
  {
    //- Master side patch
    name            AMI1;
    patchInfo
    {
      type            cyclicAMI;
      matchTolerance  0.0001;
      neighbourPatch  AMI2;
      transform       noOrdering;
    }
    constructFrom patches;
    patches (innerCylinderSmall);
  }
  {
    //- Slave side patch
    name            AMI2;
    patchInfo
    {
      type            cyclicAMI;
      matchTolerance  0.0001;
      neighbourPatch  AMI1;
      transform       noOrdering;
    }
    constructFrom patches;
    patches (innerCylinderSmall_slave);
  }
  {
    name inlet;
    patchInfo
    {
      type            patch;
    }
    constructFrom set;
    set inletFaces;
  }
  {
    name outlet;
    patchInfo
    {
      type            patch;
    }
    constructFrom set;
    set outletFaces;
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
