0.1.0/tutorials/incompressible/dym-pimple/propeller/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      decomposeParDict;
}

numberOfSubdomains 4;
method          hierarchical;
hierarchicalCoeffs
{
  n               (1 4 1);
  delta           0.001;
  order           xyz;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
