0.1.0/tutorials/incompressible/dym-pimple/propeller/system/surfaceFeatureExtractDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      surfaceFeatureExtractDict;
}

//innerCylinder.obj
//{
//    #include "surfaceFeatureExtractDictDefaults"
//}
innerCylinderSmall.obj
{
  #include "surfaceFeatureExtractDictDefaults"
}
outerCylinder.obj
{
  #include "surfaceFeatureExtractDictDefaults"
}
propellerStem1.obj
{
  #include "surfaceFeatureExtractDictDefaults"
}
propellerStem2.obj
{
  #include "surfaceFeatureExtractDictDefaults"
}
propellerStem3.obj
{
  #include "surfaceFeatureExtractDictDefaults"
}
propellerTip.obj
{
  #include "surfaceFeatureExtractDictDefaults"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
